; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v3 ?v8)
             (pred_1 ?v7 ?v12)
             (pred_8 ?v3 ?v12)
             (pred_12 ?v13 ?v3 )
	     (pred_7 ?v3)
             (pred_3 ?v4)
             (pred_6 ?v7)
             (pred_10 ?v12)
             (pred_11 ?v3)
             (pred_9 ?v7)
             (pred_4 ?v3)
             (pred_5 ))



(:action op_4
:parameters (?v2 ?v5 ?v10 ?v11)
:precondition (and (pred_3 ?v2) (pred_3 ?v5) (pred_6 ?v10) (pred_10 ?v11)
          (pred_2 ?v2 ?v5) (pred_1 ?v10 ?v11)
                   (pred_8 ?v5 ?v11) (pred_7 ?v2) 
                   (pred_11 ?v5) (pred_9 ?v10))
:effect (and  (pred_4 ?v5) (not (pred_11 ?v5))))


(:action op_3
:parameters (?v2 ?v9)
:precondition (and (pred_3 ?v2) (pred_3 ?v9)
               (pred_7 ?v2) (pred_2 ?v2 ?v9) (pred_4 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v2))))

(:action op_5
:parameters (?v2 ?v10)
:precondition (and (pred_3 ?v2) (pred_6 ?v10) 
                  (pred_7 ?v2) (pred_12 ?v10 ?v2) (pred_5 ))
:effect (and (pred_9 ?v10)
   (not (pred_12 ?v10 ?v2)) (not (pred_5 ))))


(:action op_2
:parameters (?v2 ?v1 ?v6)
:precondition (and (pred_3 ?v2) (pred_6 ?v1) (pred_6 ?v6)
                  (pred_7 ?v2) (pred_9 ?v6) (pred_12 ?v1 ?v2))
:effect (and (pred_9 ?v1) (pred_12 ?v6 ?v2)
        (not (pred_9 ?v6)) (not (pred_12 ?v1 ?v2))))

(:action op_1
:parameters (?v2 ?v10)
:precondition (and (pred_3 ?v2) (pred_6 ?v10) 
                  (pred_7 ?v2) (pred_9 ?v10))
:effect (and (pred_5 ) (pred_12 ?v10 ?v2) (not (pred_9 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_03 obj_15 obj_19 obj_18 obj_06 obj_16 obj_05 obj_14 obj_02 obj_22 obj_09 obj_13 obj_04 obj_11
    obj_17 obj_20 obj_01
    obj_21 obj_07 obj_12
    )

    (:init
       (pred_5)

       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_16)
       (pred_3 obj_05)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_3 obj_13)
       (pred_3 obj_04)
       (pred_3 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_12)

       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_10)
       (pred_11 obj_22)
       (pred_8  obj_16 obj_17)
       (pred_8  obj_10 obj_20)
       (pred_8  obj_22 obj_01)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_11)

       (pred_1  obj_21 obj_17)
       (pred_1  obj_07 obj_20)
       (pred_1  obj_12 obj_01)
       (pred_12 obj_21 obj_06)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_12 obj_15)
       (pred_7 obj_04)
    )

    (:goal (and
       (pred_12 obj_07 obj_13)
       (pred_12 obj_12 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_5 obj_04 obj_07)
   deleted: (pred_12 obj_07 obj_04) (pred_5)
   added: (pred_9 obj_07)
   goals met: 0 of 2
2. (op_3 obj_04 obj_13)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_13)
   goals met: 0 of 2
3. (op_1 obj_13 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_5) (pred_12 obj_07 obj_13)
   goals met: 1 of 2
4. (op_3 obj_13 obj_04)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_04)
   goals met: 1 of 2
5. (op_3 obj_04 obj_02)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_02)
   goals met: 1 of 2
6. (op_3 obj_02 obj_06)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_06)
   goals met: 1 of 2
7. (op_3 obj_06 obj_03)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_03)
   goals met: 1 of 2
8. (op_3 obj_03 obj_15)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_15)
   goals met: 1 of 2
9. (op_5 obj_15 obj_12)
   deleted: (pred_12 obj_12 obj_15) (pred_5)
   added: (pred_9 obj_12)
   goals met: 1 of 2
10. (op_3 obj_15 obj_03)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_03)
   goals met: 1 of 2
11. (op_3 obj_03 obj_08)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_08)
   goals met: 1 of 2
12. (op_1 obj_08 obj_12)
   deleted: (pred_9 obj_12)
   added: (pred_5) (pred_12 obj_12 obj_08)
   goals met: 2 of 2
